CBMlove/window-clean-robot/mc9s08dn60.h
#define NVOPT_SEC0_MASK                 1
#define NVOPT_SEC1_MASK                 2
#define NVOPT_EPGMOD_MASK               32
#define NVOPT_FNORED_MASK               64
#define NVOPT_KEYEN_MASK                128
#define NVOPT_SEC_MASK                  3
#define NVOPT_SEC_BITNUM                0



/* Flash commands */
#define mBlank                          0x05
#define mBurstProg                      0x25
#define mByteProg                       0x20
#define mMassErase                      0x41
#define mSectorErase                    0x40
#define mEraseAbort                     0x47


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */

/* **** 25.7.2007 11:02:31 */

#define FTSTMOD                          This_symb_has_been_depreciated
#define FTSTMOD_MRDS0                    This_symb_has_been_depreciated
#define FTSTMOD_MRDS1                    This_symb_has_been_depreciated
#define FTSTMOD_MRDS                     This_symb_has_been_depreciated
#define FTSTMOD_MRDS0_MASK               This_symb_has_been_depreciated
#define FTSTMOD_MRDS1_MASK               This_symb_has_been_depreciated
#define FTSTMOD_MRDS_MASK                This_symb_has_been_depreciated
#define FTSTMOD_MRDS_BITNUM              This_symb_has_been_depreciated


/* **** 28.3.2008 14:02:04 */

#define APCTL3                           This_symb_has_been_depreciated
#define APCTL3_ADPC16                    This_symb_has_been_depreciated
#define APCTL3_ADPC17                    This_symb_has_been_depreciated
#define APCTL3_ADPC18                    This_symb_has_been_depreciated
#define APCTL3_ADPC19                    This_symb_has_been_depreciated
#define APCTL3_ADPC20                    This_symb_has_been_depreciated
#define APCTL3_ADPC21                    This_symb_has_been_depreciated
#define APCTL3_ADPC22                    This_symb_has_been_depreciated
#define APCTL3_ADPC23                    This_symb_has_been_depreciated
#define APCTL3_ADPC16_MASK               This_symb_has_been_depreciated
#define APCTL3_ADPC17_MASK               This_symb_has_been_depreciated
#define APCTL3_ADPC18_MASK               This_symb_has_been_depreciated
#define APCTL3_ADPC19_MASK               This_symb_has_been_depreciated
#define APCTL3_ADPC20_MASK               This_symb_has_been_depreciated
#define APCTL3_ADPC21_MASK               This_symb_has_been_depreciated
#define APCTL3_ADPC22_MASK               This_symb_has_been_depreciated
#define APCTL3_ADPC23_MASK               This_symb_has_been_depreciated
#endif
